In [2]:
# Import pandas for reading CSV files
import pandas as pd

# Import the people.csv first 5 rows only
people = pd.read_csv('people.csv', delimiter = ';', nrows=5)

# Set index
people = people.set_index("id_number")
people

            name                 job sex
id_number
1000        Juan  Software Developer   M
1001        John             Manager   M
1002       Peter       Data Engineer   M
1003       Deivi            Salesman   M
1004         Ana     Front Developer   F

In [3]:
# Exporting CSV

people.to_csv('people_copy.csv', index = False)

In [4]:
# Selecting dataframes parts

people.loc["1000":"1001","name":"job"]

           name                 job
id_number
1000       Juan  Software Developer
1001       John             Manager

In [5]:
# Selecting full column as a list

list(people.loc[:, "job"])

['Software Developer',
 'Manager',
 'Data Engineer',
 'Salesman',
 'Front Developer']

In [6]:
# Using iloc function

people.iloc[1:3, 1:3]

                     job sex
id_number
1001             Manager   M
1002       Data Engineer   M

In [7]:
# Dropping columns

people.drop("job", 1)

            name sex
id_number
1000        Juan   M
1001        John   M
1002       Peter   M
1003       Deivi   M
1004         Ana   F

In [8]:
# Dropping rows

people.drop(1001, 0)

            name                 job sex
id_number
1000        Juan  Software Developer   M
1002       Peter       Data Engineer   M
1003       Deivi            Salesman   M
1004         Ana     Front Developer   F

In [9]:
# Adding columns

people["age"] = [20, 30, 24, 32, 20]
people["country"] = people.shape[0]*["col"]
people

            name                 job sex  age country
id_number
1000        Juan  Software Developer   M   20     col
1001        John             Manager   M   30     col
1002       Peter       Data Engineer   M   24     col
1003       Deivi            Salesman   M   32     col
1004         Ana     Front Developer   F   20     col

In [10]:
# Modifying columns

people["job"] = people["job"] + "."
people

            name                  job sex  age country
id_number
1000        Juan  Software Developer.   M   20     col
1001        John             Manager.   M   30     col
1002       Peter       Data Engineer.   M   24     col
1003       Deivi            Salesman.   M   32     col
1004         Ana     Front Developer.   F   20     col

In [11]:
# Import pandas for reading CSV files
import pandas as pd

# Some properties# Import pandas for reading CSV files
import pandas as pd

# Import the people.csv first 5 rows only
people = pd.read_csv('people.csv', delimiter = ';', nrows=5)
people.set_index("name")
people

print(people.shape)

(5, 4)

In [12]:
# Import pandas for reav CSV files
import pandas as pd

# Import the people.csv first 5 rows only
people = pd.read_csv('people.csv', delimiter = ';', nrows=5)

# Selecting names as a panda dataframe
names = people[['name']]
print(names)
print(" ")

# Just selecting data
names2 = people.name
print(names2)

    name
0   Juan
1   John
2  Peter
3  Deivi
4    Ana

0     Juan
1     John
2    Peter
3    Deivi
4      Ana
Name: name, dtype: object

In [13]:
# Import pandas for reading CSV files
import pandas as pd

people = pd.read_csv('people.csv', delimiter = ';')

group = people.groupby(['job'])['id_number'].count().sort_values(ascending = False)
print(group)

job
Software Developer    5
Data Engineer         5
Salesman              3
Front Developer       3
Designer              2
DBA                   2
Manager               1
Name: id_number, dtype: int64

In [14]:
# Import pandas for read CSV files
import pandas as pd

# Import pyplot for use histograms
import matplotlib.pyplot as pt

# Import full people.csv file
people = pd.read_csv('people.csv', delimiter = ';')

# Selecting names as a panda series
sex = people[['sex']]

pt.xlabel('Sex')
pt.ylabel('People')
pt.title('Boys vs Girls')
pt.hist(sex, bins=3)
pt.show()